{"id":17,"date":"2019-08-21T06:08:56","date_gmt":"2019-08-21T06:08:56","guid":{"rendered":"https:\/\/deutchb.com\/?page_id=17"},"modified":"2019-08-21T06:08:56","modified_gmt":"2019-08-21T06:08:56","slug":"residential-loans","status":"publish","type":"page","link":"https:\/\/wintechb.com\/residential-loans\/","title":{"rendered":"Residential Loans"},"content":{"rendered":"\n<p>At U.S. Century Bank, we want to Welcome&nbsp;<strong>YOU<\/strong>&nbsp;home with a Home Mortgage Loan that is right for you. You can count on&nbsp;<strong>US<\/strong>&nbsp;to help you every step of the way with our knowledgeable Home Mortgage Lending Team. Another way we work&nbsp;<strong>TOGETHER<\/strong>&nbsp;to make our community a place where families prosper and businesses grow!<\/p>\n\n\n\n<h2>Buying a Home<\/h2>\n\n\n\n<p>Whatever your reason for buying a home, at U.S. Century Bank we have a Home Mortgage for you and we have the expertise to answer all your questions and explain all your options. We offer very competitive interest rates on both Fixed Rate and Adjustable Rate loans and help you find the right one to meet your budget needs. From application to closing, we have a clear, straightforward, easy to understand process to get you into that home as easily and quickly as possible.<\/p>\n\n\n\n<p>Our&nbsp;<strong>First Time Homebuyer Programs<\/strong>&nbsp;are available if you’ve never owned your own home offering unique benefits to give you an affordable home mortgage including a low fixed rate for qualified applicants, local government programs for low to moderate income homebuyers, and down payment assistance programs through government agencies.<\/p>\n\n\n\n<p>In our diverse South Florida community, we’re proud to welcome visitors from all over the world and when ready to purchase property here, we’re ready to help with&nbsp;<strong>Home Mortgage Loans for Foreign Nationals&nbsp;<\/strong>(Non-Resident Aliens). We offer adjustable and fixed rate mortgage options, jumbo loans, and loans for either primary or vacation residences and investment properties.<\/p>\n\n\n\n<h2>Buying a Vacation Home or Investment Property<\/h2>\n\n\n\n<p>At U.S. Century Bank, we also have the expertise and experience for specialized financing for buying second homes and investment property. South Florida Real Estate has a history of long term success and our special programs help you take advantage of opportunities and maximize your returns with the right financing options. We finance single family, multifamily, and condominiums with our broad array of loan options.<\/p>\n\n\n\n<h2>&nbsp;Refinancing Your Current Home<\/h2>\n\n\n\n<p>Refinancing your current home mortgage loan with a U.S. Century Bank Home Mortgage can be a very smart financial decision. Talk with us to see if you can lower your rate and your payment with one of our refinance loan options. Take advantage of the appreciation of your home to take out cash for any worthwhile purpose. You can use the added value in your home for home improvements, financing college education, making investments, and more.&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>At U.S. Century Bank, we want to Welcome&nbsp;YOU&nbsp;home with a Home Mortgage Loan that is right for you. You can count on&nbsp;US&nbsp;to help you every step of the way with our knowledgeable Home Mortgage Lending Team. Another way we work&nbsp;TOGETHER&nbsp;to make our community a place where families prosper and businesses grow! Buying a Home Whatever [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":18,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/pages\/17"}],"collection":[{"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/comments?post=17"}],"version-history":[{"count":1,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/pages\/17\/revisions"}],"predecessor-version":[{"id":19,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/pages\/17\/revisions\/19"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/media\/18"}],"wp:attachment":[{"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/media?parent=17"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}