{"id":66,"date":"2019-08-21T21:28:40","date_gmt":"2019-08-21T21:28:40","guid":{"rendered":"https:\/\/deutchb.com\/?page_id=66"},"modified":"2019-08-21T21:28:40","modified_gmt":"2019-08-21T21:28:40","slug":"personal-e-banking","status":"publish","type":"page","link":"https:\/\/wintechb.com\/personal-e-banking\/","title":{"rendered":"Personal E-Banking"},"content":{"rendered":"\n<h2>Personal E-Banking Services<\/h2>\n\n\n\n<p>Let’s face it, in life there are higher priorities for your time than going to the bank! At Deutsche Finance, we realize that you need to spend less time banking so that you can spend more time doing things that really matter. We have state of the art technology to make your banking simple and fast.<\/p>\n\n\n\n<h2>Personal Internet Banking<\/h2>\n\n\n\n<p>Enjoy the benefits of instant access to your Deutsche Finance account information with our Free Personal Internet Banking. It’s simple. It’s convenient. Most of all, it’s secure. You have 24\/7 access to your account information to check balances, see activity, transfer funds and even view cancelled checks. Try it and you’ll see why banking has never been so easy and so fast!<\/p>\n\n\n\n<h2>Bill Pay<\/h2>\n\n\n\n<p>Forget the hassle of writing checks, stuffing and mailing envelopes. Stop purchasing postage stamps and going to the Post Office. Make paying your bills fast and simple with Deutsche Finance’s Free Bill Pay service. You can receive and pay your bills online, make one-time or recurring payments. <\/p>\n\n\n\n<h2>Personal Mobile Banking<\/h2>\n\n\n\n<p>Mobile Banking takes convenience to the next level providing on the go access to your personal accounts. Although you can access Internet Banking through your mobile browser, Access and view your Deutsche Finance  accounts and recent account activity. You can also transfer funds between your accounts, schedule bill payments, deposit checks and locate nearby banking centers and ATMs.<\/p>\n\n\n\n<h2>Personal Mobile Check Deposit<\/h2>\n\n\n\n<p>Another great time-saving feature of our Personal Mobile Banking service allows you to deposit your checks with a click of the camera! Don’t walk around with that check, where it could get lost or stolen, deposit it immediately and securely with your phone. When you receive a check, you simply endorse the back of the check.<\/p>\n\n\n\n<p>To bank online, you must already have a Deutsche Finance personal or business checking, savings or money market account. To open an account and enroll in our Internet Banking,<\/p>\n\n\n\n<h2>Security<\/h2>\n\n\n\n<p>Bank online with peace of mind! Deutsche Finance takes strong measures to protect against unauthorized access to your account and financial information and to ensure payments are processed on the dates and for the dollar amounts you select.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Personal E-Banking Services Let’s face it, in life there are higher priorities for your time than going to the bank! At Deutsche Finance, we realize that you need to spend less time banking so that you can spend more time doing things that really matter. We have state of the art technology to make your [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":67,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/pages\/66"}],"collection":[{"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/comments?post=66"}],"version-history":[{"count":1,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/pages\/66\/revisions"}],"predecessor-version":[{"id":68,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/pages\/66\/revisions\/68"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/media\/67"}],"wp:attachment":[{"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/media?parent=66"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}