{"id":69,"date":"2019-08-21T21:32:54","date_gmt":"2019-08-21T21:32:54","guid":{"rendered":"https:\/\/deutchb.com\/?page_id=69"},"modified":"2019-08-21T21:32:54","modified_gmt":"2019-08-21T21:32:54","slug":"treasury-management-services","status":"publish","type":"page","link":"https:\/\/wintechb.com\/treasury-management-services\/","title":{"rendered":"Treasury Management Services"},"content":{"rendered":"\n<p>With our Treasury Management Services you can manage your business account easily and conveniently, anytime. Take advantage of our full range of account and payment services with enhanced safety and security measures.<\/p>\n\n\n\n<h2>Online Cash Management<\/h2>\n\n\n\n<p>From a secure location you have access to:<\/p>\n\n\n\n<ul><li>Cash Position<\/li><li>Initiate and schedule internal transfers<\/li><li>View statements and deposits online<\/li><li>Track all online activity<\/li><li>Process Tax Payments<\/li><li>Make Bill Payments and Issue Stop Payments<\/li><li>Process Loan Payments<\/li><\/ul>\n\n\n\n<p>Our platform supports multiple users, and allows you to provide each user with varying levels of access via security tokens for ACH and wire-initiated transactions. You can also export transaction information using different file formats to work with your accounting software.<\/p>\n\n\n\n<h2>ACH Origination Services<\/h2>\n\n\n\n<p>Our ACH Origination Services helps you control the flow of money in and out of your account. It is simple, providing fast transfers and access to your funds right away. It’s efficient, saving you the time it takes to process incoming paper checks. It’s timely, allowing you to directly debit payments owed to you on time. It’s safe, reducing the risk of fraud and minimizing the opportunities for lost or stolen checks. Simply said, it simplifies the business of handling your finances so that you can devote your time and energy to building your business.<\/p>\n\n\n\n<p>Whether you need to initiate direct deposit of payroll and vendor payments, collect client payments on a timely basis, or handle Federal or State tax payment and more, Deutsche Finance’s ACH Origination Services can help you run your business better.<\/p>\n\n\n\n<h2>Wire Transfer Services<\/h2>\n\n\n\n<p>At Deutsche Finance you can initiate wire transfers quickly, easily and securely right from your office. You can establish recurring transfers and receive incoming wires notifications.<\/p>\n\n\n\n<h2>Positive Pay<\/h2>\n\n\n\n<p>Positive Pay is one of the most effective automated check fraud prevention programs available. This service is the process through which your company and Deutsche Finance work together to detect fraudulent activity by identifying items presented for payment that your company did not issue. Positive Pay is a highly effective defense against check fraud providing multiple levels of security. It also improves efficiency in your account reconciliation process. If this is a concern for your company, Positive Pay is your solution.<\/p>\n\n\n\n<h2>Account Reconciliation<\/h2>\n\n\n\n<p>Account Reconciliation provides reports of checks issued by the Company. This will assist you in balancing accounts, reducing administrative costs, and managing risk.<\/p>\n\n\n\n<p>If your business processes a significant number of checks and you don’t have time to run to the bank to deposit them, check out our Remote Deposit Capture Service.<\/p>\n\n\n\n<h2>Lockbox Banking Services<\/h2>\n\n\n\n<p>Lockbox Banking Services are designed to improve the efficiency and cash flow of your business by accelerating the processing of payments received from customers. It is a cost-effective way to process payments and speed up access to funds while reducing operating expenses.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>With our Treasury Management Services you can manage your business account easily and conveniently, anytime. Take advantage of our full range of account and payment services with enhanced safety and security measures. Online Cash Management From a secure location you have access to: Cash Position Initiate and schedule internal transfers View statements and deposits online [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":71,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/pages\/69"}],"collection":[{"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/comments?post=69"}],"version-history":[{"count":1,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/pages\/69\/revisions"}],"predecessor-version":[{"id":72,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/pages\/69\/revisions\/72"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/media\/71"}],"wp:attachment":[{"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/media?parent=69"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}