{"id":9,"date":"2019-08-21T06:01:35","date_gmt":"2019-08-21T06:01:35","guid":{"rendered":"https:\/\/deutchb.com\/?page_id=9"},"modified":"2021-03-06T04:23:29","modified_gmt":"2021-03-06T04:23:29","slug":"personal-savings","status":"publish","type":"page","link":"https:\/\/wintechb.com\/personal-savings\/","title":{"rendered":"Personal Savings"},"content":{"rendered":"\n<p>Creating a better future for&nbsp;<strong>You<\/strong>&nbsp;and your family, that’s why you save money for tomorrow. Whatever your dreams are, or even just to be prepared for that rainy day, Deutsche Finance has a personal savings option that can meet your needs with all the safety and security of knowing your money will be there when you need it.<\/p>\n\n\n\n<h2>Personal Savings*<\/h2>\n\n\n\n<p>A simple and convenient way to help you get your finances on the right track. This low balance requirement account, only $250 to open and maintain to avoid the $10 quarterly maintenance fee, provides interest at a competitive rate compounded daily and credited quarterly, a detailed quarterly statement, and free internet and mobile banking with 24 hour access to your information. A great option to get your savings started and begin to build for your future.<\/p>\n\n\n\n<h2>Century Gold Personal Savings*<\/h2>\n\n\n\n<p>Step up to our ACE Gold Personal Savings account, where you will earn higher interest on your higher balances. You only need $500 to open our Century Gold Savings Account and when you maintain that $500 balance you avoid the $10 quarterly maintenance fee. As with all of our savings options, you get the convenience of free internet and mobile banking with 24 hour access to your information, a detailed quarterly statement, and a competitive interest rate that is compounded daily and credited quarterly.<\/p>\n\n\n\n<h2>Century Gold Personal Money Market*<\/h2>\n\n\n\n<p>Enjoy the privileges of a classic money market account where you have check access to your money along with preauthorized, automatic transfers, online or mobile transfers and debit card access as long as you stay within the limit of six for each month. Plus, you earn a competitive interest rate making your money work harder for you. You only need $500 to open our Century Gold Personal Money Market account and when you maintain that $500 balance you avoid the $10 monthly maintenance fee. Plus you get the convenience of free internet and mobile banking with 24 hour access to your account and information, a detailed monthly statement, and a competitive interest rate that is compounded daily and credited monthly.<\/p>\n\n\n\n<h2>Certificates of Deposit<\/h2>\n\n\n\n<p>If you are looking for a secure place for your money that avoids the volatility of the market, Deutsche Finance offers&nbsp;<strong>You<\/strong>&nbsp;a variety of CD options with a choice of maturities and competitive fixed interest rates where your money grows worry-free. Our CDs require a minimum deposit of $1000 to open and our competitive interest rates compound daily and are credited monthly. You can even have your interest transferred to another account. As with all of our savings and investment options, you enjoy free internet and mobile banking with 24 hour access to your information. Keep in mind that an early withdrawal penalty will apply if the CD is closed prior to maturity. Please contact a Deutsche Finance financial service professional at the branch nearest you (Link to locations) to learn more about our CD products and rates.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Creating a better future for&nbsp;You&nbsp;and your family, that’s why you save money for tomorrow. Whatever your dreams are, or even just to be prepared for that rainy day, Deutsche Finance has a personal savings option that can meet your needs with all the safety and security of knowing your money will be there when you [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":130,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/pages\/9"}],"collection":[{"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/comments?post=9"}],"version-history":[{"count":6,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/pages\/9\/revisions"}],"predecessor-version":[{"id":474,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/pages\/9\/revisions\/474"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/media\/130"}],"wp:attachment":[{"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/media?parent=9"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}