{"id":98,"date":"2019-08-21T21:51:38","date_gmt":"2019-08-21T21:51:38","guid":{"rendered":"https:\/\/deutchb.com\/?page_id=98"},"modified":"2019-08-21T21:51:38","modified_gmt":"2019-08-21T21:51:38","slug":"loans-lines-of-credit","status":"publish","type":"page","link":"https:\/\/wintechb.com\/loans-lines-of-credit\/","title":{"rendered":"Loans &#038; Lines of Credit"},"content":{"rendered":"\n<p>Because Your Business is our Business! As a locally owned and managed community bank, Deutsche Finance has a team of seasoned bankers who are ready to help your business grow and succeed in today’s competitive marketplace. As a relationship-driven organization, our goal is to provide local business owners with the tools you need today, when they count most. We offer you the credit solutions that will keep your business healthy, growing and operating smoothly. Whether you need to purchase new equipment, improve your cash flow, or expand your facility, we have the right type of loan for your business needs. In addition to delivering fast loan commitments, we offer financing solutions that are flexible, competitive and promptly funded. <strong>You<\/strong> can rely on our commercial lending team to provide you with the highest level of personalized service and lending expertise. <strong>Together<\/strong> we can help build a stronger community where businesses prosper!<\/p>\n\n\n\n<h2>Asset Based Loans<\/h2>\n\n\n\n<p>Deutsche Finance offers Asset-Based Loans for medium and large-sized businesses. Loans are secured by current assets with up to 80% loan to value. These loans are helpful to finance account receivables and inventory, and will assist your cash flow needs. Asset-Based Loans are typically structured as a revolving line of credit without a scheduled repayment and on an interest-only basis. We advance funds based on a percentage of the accounts receivable and inventory and, when such assets convert to cash, the advances are repaid accordingly. You can borrow, repay and re-borrow as needed over the life of the loan facility.<\/p>\n\n\n\n<h2>Lines of Credit<\/h2>\n\n\n\n<p>Deutsche Finance is committed to helping you grow your business. Our secured lines of credit can give your business the additional flexibility it needs by allowing you to finance short-term cash needs to purchase inventory or equipment or even to use it as working capital. Establishing a business line of credit reduces the time you spend on day-to-day cash flow and allows you to focus on your business.<\/p>\n\n\n\n<h2>Term Loans<\/h2>\n\n\n\n<p>Do you need to modernize your plant, finance a major new equipment purchase, refinance debt or obtain permanent working capital? Our Term Loans can finance fixed assets, the purchase of new machinery or other capital equipment, as well as help you restructure your debt. Deutsche Finance’s business term loans, with up to five-year maturities, provide you with the funding you need to expand your business and even take advantage of new technology.<\/p>\n\n\n\n<h2>Small Business Loans (SBA)<\/h2>\n\n\n\n<p>We can help your business grow with a Small Business Loan secured by the U.S. Small Business Administration (SBA). SBA loans are usually affordable and easier to secure than traditional financing. Contact any of our professional business bankers today and we can guide you for future growth.<br><em>All loans are subject to credit approval and product requirements.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Because Your Business is our Business! As a locally owned and managed community bank, Deutsche Finance has a team of seasoned bankers who are ready to help your business grow and succeed in today’s competitive marketplace. As a relationship-driven organization, our goal is to provide local business owners with the tools you need today, when [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":99,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/pages\/98"}],"collection":[{"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/comments?post=98"}],"version-history":[{"count":1,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/pages\/98\/revisions"}],"predecessor-version":[{"id":100,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/pages\/98\/revisions\/100"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/media\/99"}],"wp:attachment":[{"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/media?parent=98"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}