{"id":63,"date":"2019-08-21T21:25:13","date_gmt":"2019-08-21T21:25:13","guid":{"rendered":"https:\/\/deutchb.com\/?page_id=63"},"modified":"2019-08-21T21:25:13","modified_gmt":"2019-08-21T21:25:13","slug":"e-banking-services","status":"publish","type":"page","link":"https:\/\/wintechb.com\/e-banking-services\/","title":{"rendered":"E-Banking Services"},"content":{"rendered":"\n<p>Running a business takes time and hard work, managing your banking shouldn’t.&nbsp;<strong>You<\/strong>&nbsp;work hard to grow your business and you need a bank that will work for your business providing state of the art technology that simplifies your banking. At Deutsche Finance that comes with personal service that creates a meaningful relationship between you and your banker.<\/p>\n\n\n\n<h2>Business Internet Banking<\/h2>\n\n\n\n<p>We make it simple for you to manage your Business accounts online. If you are a business owner, you also have the option to manage your Business and Personal accounts together making it easier to facilitate managing all of your banking in one place. Our state of the art technology makes it simple, convenient, and most importantly, secure to access your accounts 24\/7, check balances, see activity, transfer funds, and pay your bills. You can also view cancelled checks and sign-up for E-Statements, removing clutter and helping the environment.<\/p>\n\n\n\n<h2>Business Mobile Banking<\/h2>\n\n\n\n<p>Mobile Banking takes convenience to the next level providing on the go access to your business accounts. Although you can access Online Banking through your mobile browser, our Business Mobile Banking application, Access and view your Deutsche Finance accounts and recent account activity. You can also transfer funds between your accounts, schedule bill payments, deposit checks and locate nearby banking centers and ATMs.<\/p>\n\n\n\n<p>To bank online, you must already have a Deutsche Finance personal or business checking, savings or money market account. To open an account and enroll in our Internet Banking,<\/p>\n\n\n\n<p>If your business processes a significant number of checks and you don’t have time to run to the bank to deposit them, check out our Remote Deposit Capture Service.<\/p>\n\n\n\n<p>For more services to help&nbsp;<strong>You<\/strong>&nbsp;manage your business finances, check out our Treasury Management Services.<\/p>\n\n\n\n<h2>Security<\/h2>\n\n\n\n<p>Bank online with peace of mind! Deutsche Finance takes strong measures to protect against unauthorized access to your account and financial information and to ensure payments are processed on the dates and for the dollar amounts you select.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Running a business takes time and hard work, managing your banking shouldn’t.&nbsp;You&nbsp;work hard to grow your business and you need a bank that will work for your business providing state of the art technology that simplifies your banking. At Deutsche Finance that comes with personal service that creates a meaningful relationship between you and your [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":64,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"fullwidth.php","meta":[],"_links":{"self":[{"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/pages\/63"}],"collection":[{"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/comments?post=63"}],"version-history":[{"count":1,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/pages\/63\/revisions"}],"predecessor-version":[{"id":65,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/pages\/63\/revisions\/65"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/media\/64"}],"wp:attachment":[{"href":"https:\/\/wintechb.com\/wp-json\/wp\/v2\/media?parent=63"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}